; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_2 ?v2 - type_1 ?v4 - type_2)
 	      (pred_4 ?v6 - object ?v4 - type_2)
	      (pred_3 ?v2 - type_1 ?v5 - type_3)
	      (pred_1 ?v2 - type_1 ?v6 - object ?v5 - type_3))

   (:action op_2
       :parameters  (?v2 - type_1 ?v7 ?v1 - type_2)
       :precondition (and  (pred_2 ?v2 ?v7))
       :effect (and  (pred_2 ?v2 ?v1)
		     (not (pred_2 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_1 ?v8 - object ?v3 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_4 ?v8 ?v3) (pred_2 ?v2 ?v3) (pred_3 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v3)) 
		    (not (pred_3 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_1 ?v8 - object ?v3 - type_2 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v8 ?v5) (pred_2 ?v2 ?v3))
       :effect (and (pred_4 ?v8 ?v3)
		    (pred_3 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v8 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_07 - type_1
obj_02 obj_01 - type_3
obj_04 obj_03 obj_05 - type_2
obj_08 obj_09 obj_06 - object)
(:init
(pred_2 obj_07 obj_05)
(pred_3 obj_07 obj_02)
(pred_3 obj_07 obj_01)
(pred_4 obj_08 obj_03)
(pred_4 obj_09 obj_04)
(pred_4 obj_06 obj_05)
)
(:goal
(and
(pred_4 obj_08 obj_04)
(pred_4 obj_09 obj_03)
(pred_4 obj_06 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_07 ?b obj_02))))
)
)

; plan
1. (op_3 obj_07 obj_06 obj_05 obj_01)
   deleted: (pred_4 obj_06 obj_05) (pred_3 obj_07 obj_01)
   added: (pred_1 obj_07 obj_06 obj_01)
   goals met: 0 of 3
2. (op_2 obj_07 obj_05 obj_04)
   deleted: (pred_2 obj_07 obj_05)
   added: (pred_2 obj_07 obj_04)
   goals met: 0 of 3
3. (op_1 obj_07 obj_06 obj_04 obj_01)
   deleted: (pred_1 obj_07 obj_06 obj_01)
   added: (pred_4 obj_06 obj_04) (pred_3 obj_07 obj_01)
   goals met: 1 of 3
4. (op_3 obj_07 obj_09 obj_04 obj_01)
   deleted: (pred_4 obj_09 obj_04) (pred_3 obj_07 obj_01)
   added: (pred_1 obj_07 obj_09 obj_01)
   goals met: 1 of 3
5. (op_2 obj_07 obj_04 obj_03)
   deleted: (pred_2 obj_07 obj_04)
   added: (pred_2 obj_07 obj_03)
   goals met: 1 of 3
6. (op_1 obj_07 obj_09 obj_03 obj_01)
   deleted: (pred_1 obj_07 obj_09 obj_01)
   added: (pred_4 obj_09 obj_03) (pred_3 obj_07 obj_01)
   goals met: 2 of 3
7. (op_3 obj_07 obj_08 obj_03 obj_01)
   deleted: (pred_4 obj_08 obj_03) (pred_3 obj_07 obj_01)
   added: (pred_1 obj_07 obj_08 obj_01)
   goals met: 2 of 3
8. (op_2 obj_07 obj_03 obj_04)
   deleted: (pred_2 obj_07 obj_03)
   added: (pred_2 obj_07 obj_04)
   goals met: 2 of 3
9. (op_1 obj_07 obj_08 obj_04 obj_01)
   deleted: (pred_1 obj_07 obj_08 obj_01)
   added: (pred_4 obj_08 obj_04) (pred_3 obj_07 obj_01)
   goals met: 3 of 3
